---
kind: property
id: P:Autodesk.Revit.DB.SymbolicCurveArray.IsEmpty
source: html/fc98381d-7925-9133-7567-3427ba5bbbf3.htm
---
# Autodesk.Revit.DB.SymbolicCurveArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.